In [1]:
import numpy as np
import pandas as pd

In [ ]:
#Nan : missing numerical data

In [2]:
vals2 = np.array([1, np.nan,3,4])
vals2

array([ 1., nan,  3.,  4.])

In [3]:
vals2.sum()

nan

In [4]:
vals2.min()

nan

In [5]:
vals2.max()

nan

In [6]:
#perform operations while ignoring nan values
np.nansum(vals2)

8.0

In [7]:
np.nanmin(vals2), np.nanmax(vals2)

(1.0, 4.0)

In [10]:
#pandas nullable dtypes
pd.Series([1, np.nan, None, pd.NA, 4], dtype = 'Int32')

0       1
1    <NA>
2    <NA>
3    <NA>
4       4
dtype: Int32

In [ ]:
#detecting null values

In [12]:
data = pd.Series([1, np.nan, 'hello', None])
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [14]:
data[data.isnull()]

1     NaN
3    None
dtype: object

In [16]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [ ]:
#dropping null values :

In [20]:
data.dropna()

0        1
2    hello
dtype: object

In [8]:
df = pd.DataFrame([[1, np.nan, 2],
                  [2, 3, 5],
                  [np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [10]:
df[0:1]

     0   1  2   3
0  1.0 NaN  2 NaN

In [22]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [5]:
#drop along column
df.dropna(axis=1)

   2
0  2
1  5
2  6

In [9]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [14]:
#only drop if all values are null
df.dropna(axis='columns',how = 'all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [16]:
#thresh param : only drop if min number of non values are to be kept. 
#Drop those rows that have less than 3 non null values
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [4]:
#filling null vals in series 
data = pd.Series([1, np.nan,2,np.nan,3], index = ['a','b','c','d','e'], dtype = 'Int32')
data

a       1
b    <NA>
c       2
d    <NA>
e       3
dtype: Int32

In [5]:
#fill with 0
data.fillna(0)

a    1
b    0
c    2
d    0
e    3
dtype: Int32

In [6]:
#forward fill to propagate previous value forward
data.fillna(method = 'ffill')

a    1
b    1
c    2
d    2
e    3
dtype: Int32

In [7]:
#backward fill to propagate next value backward
data.fillna(method = 'bfill')

a    1
b    2
c    2
d    3
e    3
dtype: Int32

In [10]:
#dataframe
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [13]:
df.fillna(method='ffill', axis=1) #along row. writing axis = rows does not work

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0